package expressjava.practice1.homework.test;

/*3. Метод для нахождения разницы между двумя числами
Условие:
Создайте метод difference(int x, int y), который возвращает модуль разности двух чисел.
Проверьте метод в main.*/
/*Способ: Вычитание меньшего из большего
Модуль разности — это всегда расстояние, а расстояние не может быть отрицательным.
Чтобы сразу получить положительный результат без проверок знака, можно пойти от обратного:
1. Сначала сравнить два числа между собой.
2. Определить, какое из них больше (или равно), а какое меньше.
3. Вычесть из большего числа меньшее. Полученный результат автоматически будет модулем их разности.*/
public class Difference {

    public static int difference(int x, int y) {
        return x > y ? x - y : y - x;
    }

    public static void main(String[] args) {
        System.out.println(difference(3, 5)); // 2
        System.out.println(difference(5, 3)); // 2
        System.out.println(difference(5, 5)); // 0
    }
}
